[
    {"name": "Washington", "year": 1789, "description": "Washington established the first U.S. cabinet, appointing secretaries to advise on national affairs."},
    {"name": "Washington", "year": 1790, "description": "Washington signed the Residence Act, designating a new capital site along the Potomac River."},
    {"name": "Washington", "year": 1791, "description": "Washington approved the Bill of Rights, adding ten amendments to the Constitution."},
    {"name": "Washington", "year": 1792, "description": "Washington signed the Coinage Act, establishing the U.S. Mint for national currency."},
    {"name": "Washington", "year": 1793, "description": "Washington declared U.S. neutrality in the French Revolutionary Wars, avoiding European conflict."},
    {"name": "Washington", "year": 1794, "description": "Washington led troops to suppress the Whiskey Rebellion, affirming federal authority."},
    {"name": "Washington", "year": 1795, "description": "Washington signed the Jay Treaty, improving trade relations with Britain despite controversy."},
    {"name": "Washington", "year": 1796, "description": "Washington delivered his Farewell Address, warning against political factions and foreign alliances."},
    {"name": "J. Adams", "year": 1797, "description": "Adams navigated the XYZ Affair, exposing French demands for bribes in peace talks."},
    {"name": "J. Adams", "year": 1798, "description": "Adams signed the Alien and Sedition Acts, aiming to protect national security amid French tensions."},
    {"name": "J. Adams", "year": 1799, "description": "Adams appointed envoys to France, defusing tensions and avoiding war."},
    {"name": "J. Adams", "year": 1800, "description": "Adams oversaw the move of the federal government to the new capital, Washington, D.C."},
    {"name": "Jefferson", "year": 1801, "description": "Jefferson reduced federal spending, cutting taxes and military budgets to promote simplicity."},
    {"name": "Jefferson", "year": 1802, "description": "Jefferson established the U.S. Military Academy at West Point for officer training."},
    {"name": "Jefferson", "year": 1803, "description": "Jefferson secured the Louisiana Purchase, doubling U.S. territory for $15 million."},
    {"name": "Jefferson", "year": 1804, "description": "Jefferson sent Lewis and Clark to explore the Louisiana Territory, mapping the West."},
    {"name": "Jefferson", "year": 1805, "description": "Jefferson negotiated peace with Tripoli, ending the First Barbary War."},
    {"name": "Jefferson", "year": 1806, "description": "Jefferson signed the Non-Importation Act, restricting British goods to pressure trade policies."},
    {"name": "Jefferson", "year": 1807, "description": "Jefferson enacted the Embargo Act, halting U.S. exports to avoid European wars."},
    {"name": "Jefferson", "year": 1808, "description": "Jefferson supported the ban on importing enslaved people, effective January 1, 1808."},
    {"name": "Madison", "year": 1809, "description": "Madison repealed the Embargo Act, replacing it with the Non-Intercourse Act to ease trade tensions."},
    {"name": "Madison", "year": 1810, "description": "Madison annexed West Florida, claiming it as part of the Louisiana Purchase."},
    {"name": "Madison", "year": 1811, "description": "Madison authorized the charter of the First Bank of the United States to expire, opposing centralized banking."},
    {"name": "Madison", "year": 1812, "description": "Madison led the U.S. into the War of 1812 against Britain over trade and impressment issues."},
    {"name": "Madison", "year": 1813, "description": "Madison supported the invasion of Canada, though U.S. forces faced setbacks in the war."},
    {"name": "Madison", "year": 1814, "description": "Madison fled Washington as British troops burned the capital during the War of 1812."},
    {"name": "Madison", "year": 1815, "description": "Madison celebrated the Treaty of Ghent, ending the War of 1812 with no territorial changes."},
    {"name": "Madison", "year": 1816, "description": "Madison signed a bill creating the Second Bank of the United States to stabilize the economy."},
    {"name": "Monroe", "year": 1817, "description": "Monroe initiated the First Seminole War, sending troops to pursue Seminoles in Florida."},
    {"name": "Monroe", "year": 1818, "description": "Monroe negotiated the Anglo-American Convention, setting the U.S.-Canada border at the 49th parallel."},
    {"name": "Monroe", "year": 1819, "description": "Monroe acquired Florida from Spain via the Adams-Onís Treaty, expanding U.S. territory."},
    {"name": "Monroe", "year": 1820, "description": "Monroe signed the Missouri Compromise, balancing slave and free states in Congress."},
    {"name": "Monroe", "year": 1821, "description": "Monroe welcomed Missouri as a slave state, implementing the Missouri Compromise."},
    {"name": "Monroe", "year": 1822, "description": "Monroe recognized new Latin American republics, supporting their independence from Spain."},
    {"name": "Monroe", "year": 1823, "description": "Monroe issued the Monroe Doctrine, warning Europe against colonizing the Americas."},
    {"name": "Monroe", "year": 1824, "description": "Monroe hosted Lafayette’s U.S. tour, celebrating the Revolutionary War hero’s return."},
    {"name": "J.Q. Adams", "year": 1825, "description": "Adams proposed internal improvements, like roads and canals, to boost national infrastructure."},
    {"name": "J.Q. Adams", "year": 1826, "description": "Adams attended the Panama Congress, fostering diplomatic ties with Latin America."},
    {"name": "J.Q. Adams", "year": 1827, "description": "Adams negotiated a trade treaty with Britain, easing tensions over commerce."},
    {"name": "J.Q. Adams", "year": 1828, "description": "Adams signed the Tariff of 1828, raising duties but sparking Southern opposition."},
    {"name": "Jackson", "year": 1829, "description": "Jackson introduced the spoils system, rewarding loyal supporters with government jobs."},
    {"name": "Jackson", "year": 1830, "description": "Jackson signed the Indian Removal Act, authorizing forced relocation of Native tribes."},
    {"name": "Jackson", "year": 1831, "description": "Jackson reorganized the cabinet after the Petticoat Affair strained political alliances."},
    {"name": "Jackson", "year": 1832, "description": "Jackson vetoed the recharter of the Second Bank of the United States, weakening centralized banking."},
    {"name": "Jackson", "year": 1833, "description": "Jackson issued the Force Bill, authorizing military action to enforce tariffs in South Carolina."},
    {"name": "Jackson", "year": 1834, "description": "Jackson faced censure by the Senate over his bank veto, escalating political tensions."},
    {"name": "Jackson", "year": 1835, "description": "Jackson paid off the national debt, the only time in U.S. history."},
    {"name": "Jackson", "year": 1836, "description": "Jackson recognized Texas independence, though annexation was delayed until 1845."},
    {"name": "Van Buren", "year": 1837, "description": "Van Buren faced the Panic of 1837, addressing the economic crisis with limited federal action."},
    {"name": "Van Buren", "year": 1838, "description": "Van Buren oversaw the Trail of Tears, enforcing Cherokee removal to Oklahoma."},
    {"name": "Van Buren", "year": 1839, "description": "Van Buren negotiated the Aroostook War truce, avoiding conflict with Britain over Maine’s border."},
    {"name": "Van Buren", "year": 1840, "description": "Van Buren established the Independent Treasury System to manage federal funds."},
    {"name": "W.H. Harrison", "year": 1841, "description": "Harrison delivered a lengthy inaugural address, but died of pneumonia after one month."},
    {"name": "Tyler", "year": 1841, "description": "Tyler assumed the presidency after Harrison’s death, establishing the precedent for vice-presidential succession."},
    {"name": "Tyler", "year": 1842, "description": "Tyler signed the Webster-Ashburton Treaty, resolving U.S.-Canada border disputes."},
    {"name": "Tyler", "year": 1843, "description": "Tyler pursued annexation of Texas, though Congress initially rejected the treaty."},
    {"name": "Tyler", "year": 1844, "description": "Tyler signed a treaty with China, opening trade ports and expanding U.S. commerce."},
    {"name": "Polk", "year": 1845, "description": "Polk annexed Texas, admitting it as a state despite Mexican objections."},
    {"name": "Polk", "year": 1846, "description": "Polk signed the Oregon Treaty, securing the Pacific Northwest up to the 49th parallel."},
    {"name": "Polk", "year": 1847, "description": "Polk led the Mexican-American War, capturing key territories including California."},
    {"name": "Polk", "year": 1848, "description": "Polk signed the Treaty of Guadalupe Hidalgo, ending the Mexican-American War with vast land gains."},
    {"name": "Taylor", "year": 1849, "description": "Taylor supported California’s statehood as a free state, intensifying slavery debates."},
    {"name": "Taylor", "year": 1850, "description": "Taylor died of illness, unable to resolve the Compromise of 1850 debates."},
    {"name": "Fillmore", "year": 1850, "description": "Fillmore signed the Compromise of 1850, balancing slave and free state interests."},
    {"name": "Fillmore", "year": 1851, "description": "Fillmore enforced the Fugitive Slave Act, sparking Northern resistance."},
    {"name": "Fillmore", "year": 1852, "description": "Fillmore sent Commodore Perry to Japan, initiating trade negotiations."},
    {"name": "Pierce", "year": 1853, "description": "Pierce supported the Gadsden Purchase, acquiring land from Mexico for a railroad."},
    {"name": "Pierce", "year": 1854, "description": "Pierce signed the Kansas-Nebraska Act, escalating tensions over slavery’s expansion."},
    {"name": "Pierce", "year": 1855, "description": "Pierce faced Bleeding Kansas violence, struggling to maintain national unity."},
    {"name": "Pierce", "year": 1856, "description": "Pierce recognized the pro-slavery Kansas government, alienating Northern supporters."},
    {"name": "Buchanan", "year": 1857, "description": "Buchanan endorsed the Dred Scott decision, denying citizenship to enslaved people."},
    {"name": "Buchanan", "year": 1858, "description": "Buchanan negotiated the English Bill, attempting to admit Kansas as a slave state."},
    {"name": "Buchanan", "year": 1859, "description": "Buchanan faced the Panic of 1857, offering limited federal relief for economic woes."},
    {"name": "Buchanan", "year": 1860, "description": "Buchanan failed to prevent Southern secession after Lincoln’s election."},
    {"name": "Lincoln", "year": 1861, "description": "Lincoln called for volunteers to suppress the Southern rebellion after Fort Sumter’s fall."},
    {"name": "Lincoln", "year": 1862, "description": "Lincoln issued the preliminary Emancipation Proclamation, redefining the war’s purpose."},
    {"name": "Lincoln", "year": 1863, "description": "Lincoln delivered the Gettysburg Address, emphasizing national unity and freedom."},
    {"name": "Lincoln", "year": 1864, "description": "Lincoln supported the 13th Amendment, aiming to abolish slavery permanently."},
    {"name": "Lincoln", "year": 1865, "description": "Lincoln was assassinated, leaving Reconstruction to his successor, Andrew Johnson."},
    {"name": "Johnson", "year": 1865, "description": "Johnson began Reconstruction, issuing pardons to former Confederates."},
    {"name": "Johnson", "year": 1866, "description": "Johnson vetoed the Civil Rights Act, but Congress overrode to protect freedmen’s rights."},
    {"name": "Johnson", "year": 1867, "description": "Johnson purchased Alaska from Russia, expanding U.S. territory."},
    {"name": "Johnson", "year": 1868, "description": "Johnson faced impeachment over Tenure of Office Act violations, narrowly avoiding removal."},
    {"name": "Grant", "year": 1869, "description": "Grant established the Board of Indian Commissioners to reform Native American policy."},
    {"name": "Grant", "year": 1870, "description": "Grant signed the 15th Amendment, guaranteeing voting rights regardless of race."},
    {"name": "Grant", "year": 1871, "description": "Grant enforced the Ku Klux Klan Act, suppressing Southern violence against freedmen."},
    {"name": "Grant", "year": 1872, "description": "Grant created Yellowstone as the first national park, preserving natural heritage."},
    {"name": "Grant", "year": 1873, "description": "Grant faced the Panic of 1873, struggling to stabilize the economy."},
    {"name": "Grant", "year": 1874, "description": "Grant signed the Civil Rights Act of 1875, aiming to protect public accommodations."},
    {"name": "Grant", "year": 1875, "description": "Grant supported the Resumption Act, returning the U.S. to the gold standard."},
    {"name": "Grant", "year": 1876, "description": "Grant attended the Centennial Exposition, celebrating America’s 100th anniversary."},
    {"name": "Hayes", "year": 1877, "description": "Hayes ended Reconstruction, withdrawing federal troops from the South."},
    {"name": "Hayes", "year": 1878, "description": "Hayes signed the Bland-Allison Act, mandating silver coinage despite his veto."},
    {"name": "Hayes", "year": 1879, "description": "Hayes vetoed Chinese immigration restrictions, upholding treaty obligations."},
    {"name": "Hayes", "year": 1880, "description": "Hayes hosted the first White House Easter Egg Roll, starting a tradition."},
    {"name": "Garfield", "year": 1881, "description": "Garfield advocated civil service reform before his assassination after six months."},
    {"name": "Arthur", "year": 1881, "description": "Arthur assumed the presidency, committing to continue Garfield’s reform agenda."},
    {"name": "Arthur", "year": 1882, "description": "Arthur signed the Chinese Exclusion Act, restricting immigration for a decade."},
    {"name": "Arthur", "year": 1883, "description": "Arthur signed the Pendleton Act, establishing merit-based civil service hiring."},
    {"name": "Arthur", "year": 1884, "description": "Arthur dedicated the Washington Monument, completing a national landmark."},
    {"name": "Cleveland", "year": 1885, "description": "Cleveland vetoed fraudulent pension bills, protecting federal funds from misuse."},
    {"name": "Cleveland", "year": 1886, "description": "Cleveland dedicated the Statue of Liberty, accepting France’s gift to America."},
    {"name": "Cleveland", "year": 1887, "description": "Cleveland signed the Interstate Commerce Act, regulating railroads for fair practices."},
    {"name": "Cleveland", "year": 1888, "description": "Cleveland pushed for tariff reduction, though Congress blocked his efforts."},
    {"name": "B. Harrison", "year": 1889, "description": "Harrison signed the Sherman Antitrust Act, curbing monopolies in business."},
    {"name": "B. Harrison", "year": 1890, "description": "Harrison approved the McKinley Tariff, raising duties to protect U.S. industries."},
    {"name": "B. Harrison", "year": 1891, "description": "Harrison created the first U.S. forest reserves, preserving natural resources."},
    {"name": "B. Harrison", "year": 1892, "description": "Harrison opened Ellis Island, streamlining immigration processing."},
    {"name": "Cleveland", "year": 1893, "description": "Cleveland repealed the Sherman Silver Purchase Act, stabilizing the gold standard."},
    {"name": "Cleveland", "year": 1894, "description": "Cleveland sent troops to break the Pullman Strike, restoring rail service."},
    {"name": "Cleveland", "year": 1895, "description": "Cleveland invoked the Monroe Doctrine, mediating a Venezuela-Britain border dispute."},
    {"name": "Cleveland", "year": 1896, "description": "Cleveland maintained neutrality during the Cuban revolt, avoiding intervention."},
    {"name": "McKinley", "year": 1897, "description": "McKinley signed the Dingley Tariff, raising rates to protect American businesses."},
    {"name": "McKinley", "year": 1898, "description": "McKinley led the U.S. to victory in the Spanish-American War, gaining territories."},
    {"name": "McKinley", "year": 1899, "description": "McKinley issued the Open Door Policy, promoting equal trade in China."},
    {"name": "McKinley", "year": 1900, "description": "McKinley signed the Gold Standard Act, fixing U.S. currency to gold."},
    {"name": "McKinley", "year": 1901, "description": "McKinley was assassinated, leaving Roosevelt to pursue his policies."},
    {"name": "T. Roosevelt", "year": 1901, "description": "Roosevelt assumed the presidency, promising to continue McKinley’s policies."},
    {"name": "T. Roosevelt", "year": 1902, "description": "Roosevelt mediated the Coal Strike, securing better wages for miners."},
    {"name": "T. Roosevelt", "year": 1903, "description": "Roosevelt supported Panama’s independence, securing the Panama Canal Zone."},
    {"name": "T. Roosevelt", "year": 1904, "description": "Roosevelt issued the Roosevelt Corollary, asserting U.S. influence in Latin America."},
    {"name": "T. Roosevelt", "year": 1905, "description": "Roosevelt brokered the Treaty of Portsmouth, ending the Russo-Japanese War."},
    {"name": "T. Roosevelt", "year": 1906, "description": "Roosevelt signed the Pure Food and Drug Act, protecting consumer health."},
    {"name": "T. Roosevelt", "year": 1907, "description": "Roosevelt sent the Great White Fleet on a world tour, showcasing naval power."},
    {"name": "T. Roosevelt", "year": 1908, "description": "Roosevelt expanded national forests, conserving millions of acres."},
    {"name": "Taft", "year": 1909, "description": "Taft pursued dollar diplomacy, promoting U.S. investments abroad."},
    {"name": "Taft", "year": 1910, "description": "Taft established the U.S. Postal Savings System, aiding small savers."},
    {"name": "Taft", "year": 1911, "description": "Taft broke up the Standard Oil monopoly, enforcing antitrust laws."},
    {"name": "Taft", "year": 1912, "description": "Taft created the Children’s Bureau, addressing child welfare issues."},
    {"name": "Wilson", "year": 1913, "description": "Wilson signed the Federal Reserve Act, creating a central banking system."},
    {"name": "Wilson", "year": 1914, "description": "Wilson enacted the Clayton Antitrust Act, strengthening anti-monopoly laws."},
    {"name": "Wilson", "year": 1915, "description": "Wilson maintained neutrality as World War I escalated in Europe."},
    {"name": "Wilson", "year": 1916, "description": "Wilson signed the Keating-Owen Act, restricting child labor."},
    {"name": "Wilson", "year": 1917, "description": "Wilson led the U.S. into World War I, declaring war on Germany."},
    {"name": "Wilson", "year": 1918, "description": "Wilson proposed the Fourteen Points, outlining a vision for post-war peace."},
    {"name": "Wilson", "year": 1919, "description": "Wilson championed the League of Nations, though the U.S. didn’t join."},
    {"name": "Wilson", "year": 1920, "description": "Wilson supported the 19th Amendment, granting women the right to vote."},
    {"name": "Harding", "year": 1921, "description": "Harding signed the Budget and Accounting Act, modernizing federal budgeting."},
    {"name": "Harding", "year": 1922, "description": "Harding signed the Fordney-McCumber Tariff, raising duties to protect industries."},
    {"name": "Harding", "year": 1923, "description": "Harding died, leaving scandals like Teapot Dome to tarnish his legacy."},
    {"name": "Coolidge", "year": 1923, "description": "Coolidge assumed the presidency, restoring trust after Harding’s scandals."},
    {"name": "Coolidge", "year": 1924, "description": "Coolidge signed the Immigration Act, limiting arrivals from certain countries."},
    {"name": "Coolidge", "year": 1925, "description": "Coolidge signed the Revenue Act, cutting taxes to stimulate the economy."},
    {"name": "Coolidge", "year": 1926, "description": "Coolidge supported the Air Commerce Act, regulating aviation safety."},
    {"name": "Coolidge", "year": 1927, "description": "Coolidge vetoed farm relief bills, prioritizing limited government."},
    {"name": "Coolidge", "year": 1928, "description": "Coolidge signed the Kellogg-Briand Pact, aiming to outlaw war."},
    {"name": "Hoover", "year": 1929, "description": "Hoover faced the stock market crash, initiating the Great Depression."},
    {"name": "Hoover", "year": 1930, "description": "Hoover signed the Smoot-Hawley Tariff, raising duties but worsening trade."},
    {"name": "Hoover", "year": 1931, "description": "Hoover created the Reconstruction Finance Corporation to aid struggling businesses."},
    {"name": "Hoover", "year": 1932, "description": "Hoover dispatched troops to disperse the Bonus Army, sparking public criticism."},
    {"name": "FDR", "year": 1933, "description": "FDR launched the New Deal, creating jobs through programs like the CCC."},
    {"name": "FDR", "year": 1934, "description": "FDR signed the Securities Exchange Act, regulating Wall Street."},
    {"name": "FDR", "year": 1935, "description": "FDR signed the Social Security Act, establishing a safety net for retirees."},
    {"name": "FDR", "year": 1936, "description": "FDR won re-election, expanding New Deal programs to combat the Depression."},
    {"name": "FDR", "year": 1937, "description": "FDR proposed court-packing, attempting to reform the Supreme Court."},
    {"name": "FDR", "year": 1938, "description": "FDR signed the Fair Labor Standards Act, setting minimum wages and hours."},
    {"name": "FDR", "year": 1939, "description": "FDR maintained neutrality as World War II began in Europe."},
    {"name": "FDR", "year": 1940, "description": "FDR signed the Selective Service Act, preparing for potential war."},
    {"name": "FDR", "year": 1941, "description": "FDR delivered the Four Freedoms speech, articulating democratic ideals."},
    {"name": "FDR", "year": 1942, "description": "FDR authorized Japanese-American internment after Pearl Harbor’s attack."},
    {"name": "FDR", "year": 1943, "description": "FDR met with Allied leaders at Tehran, planning D-Day’s invasion."},
    {"name": "FDR", "year": 1944, "description": "FDR signed the GI Bill, aiding veterans with education and housing."},
    {"name": "FDR", "year": 1945, "description": "FDR died, leaving Truman to conclude World War II."}
]